{
  "warmups": [
    {
      "id": "dynamic_general",
      "name": "Dynaaminen Peruslämmittely",
      "durationMinutes": 5,
      "description": "Yleislämmittely, joka herättelee kehon liikkeeseen dynaamisilla liikkeillä. Noin 30-60 sekuntia tai 10-15 toistoa per liike.",
      "steps": [
        {
          "name": "Nivelten Pyörittelyt",
          "description": "1. Ranteet & Nilkat: Pyöritä molempia niveliä rauhallisesti myötä- ja vastapäivään n. 10 kertaa/suunta.\n2. Polvet: Seiso jalat yhdessä, kädet polvilla. Pyöritä polvia pienellä liikkeellä molempiin suuntiin.\n3. Lantio: Seiso haara-asennossa, kädet lantiolla. Pyöritä lantiota isosti molempiin suuntiin.\n4. Olkapäät: Pyöritä olkapäitä eteen ja taakse.\n5. Kyynärpäät: Koukista ja ojenna käsiä."
        },
        {
          "name": "Jalan Heilautukset",
          "description": "Ota tukea tarvittaessa. Heilauta jalkaa suorana:\n1. Eteen-taakse: Heilauta hallitusti niin korkealle kuin liikkuvuus sallii (10-15/jalka).\n2. Sivulle: Heilauta jalkaa vartalon eteen ja sivulle loitonnukseen (10-15/jalka). Pidä keskivartalo tiukkana."
        },
        {
          "name": "Vartalon Kierrot",
          "description": "Seiso lantionlevyisessä haara-asennossa, polvet hieman koukussa. Kierrä ylävartaloa rennosti puolelta toiselle, anna käsien seurata mukana. (n. 30 sek)"
        },
        {
          "name": "Syväkyykky ilman painoa",
          "description": "Seiso hartianlevyisessä asennossa, varpaat hieman ulospäin. Laskeudu hallitusti kyykkyyn niin syvälle kuin pystyt pitäen selän suorana ja kantapäät lattiassa. Voit pitää käsillä kiinni esim. ovikarmista alkuun. Nouse ylös pakaroita käyttäen. (10-12 toistoa)"
        },
        {
          "name": "Kevyt Kardio",
          "description": "Valitse yksi: \n- Kevyt hölkkä paikallaan nostellen polvia.\n- Haarahypyt rauhalliseen tahtiin.\n- Polvennostokävely.\nTavoite nostaa hieman sykettä. (n. 30-60 sek)"
        }
      ]
    },
    {
      "id": "kb_specific_prep",
      "name": "Kahvakuula Valmistelu",
      "durationMinutes": 6,
      "description": "Valmistelee kehoa erityisesti kahvakuulaliikkeisiin, kuten heilautuksiin ja nostoihin.",
      "steps": [
        {
          "name": "Lantion Saranaharjoitus (Good Morning)",
          "description": "Seiso ryhdikkäästi, kädet niskan takana tai rinnalla ristissä. Työnnä lantiota taakse ja kallista ylävartaloa eteenpäin pitäen selkä suorana (kuin niiaisit). Tunne venytys takareisissä. Ojenna lantio takaisin alkuasentoon. (10-12 hidasta toistoa)"
        },
        {
          "name": "Olkapäiden Aktivointi (Halo)",
          "description": "Ota kevyt kahvakuula (tai muu pieni paino) sarvista kiinni, pohja ylöspäin, rinnan edessä. Pyöritä kuulaa hitaasti ja hallitusti pään ympäri mahdollisimman lähellä vartaloa. Pidä keskivartalo tiukkana, älä anna lantion heilua. (4-6 kiertoa / suunta)"
        },
        {
          "name": "Rintarangan Avaukset",
          "description": "Asetu nelinkontin. Vie toinen käsi niskan taakse. Kierrä ylävartaloa avaten rintaa kohti kattoa ja laske kyynärpää hallitusti kohti lattiaa. (8-10 toistoa / puoli)"
        },
        {
          "name": "Kevyet Heilautukset (ilman kuulaa/kepikepillä)",
          "description": "Harjoittele heilautuksen liikerataa. Seiso haara-asennossa, tee lantion sarana ja kuvittele heilauttavasi kuulaa tai käytä keppiä. Keskity lantion räjähtävään ojennukseen. (10-15 toistoa)"
        },
        {
          "name": "Pokaalikyykyn pito",
          "description": "Ota kevyt kuula pokaaliotteeseen. Laskeudu kyykkyyn ja pidä asento alhaalla 10-15 sekuntia keskittyen hyvään ryhtiin ja keskivartalon tukeen. Nouse ylös. (2-3 pitoa)"
        }
      ]
    },
    {
      "id": "quick_mobility",
      "name": "Nopea Liikkuvuuslämmittely",
      "durationMinutes": 4,
      "description": "Lyhyt ja ytimekäs lämmittely liikkuvuuteen keskittyen.",
      "steps": [
        {
          "name": "Kissakameli",
          "description": "Nelinkontin. Sisäänhengityksellä notkista selkää kevyesti (lehmä/kameli). Uloshengityksellä pyöristä selkää voimakkaasti kohti kattoa (kissa). (8-10 rauhallista toistoa)"
        },
        {
          "name": "Maailman Paras Venytys (syvä askelkyykky + kierto)",
          "description": "Astu pitkä askel eteen. Laske takimmainen polvi maahan. Vie etummaisen jalan puoleinen käsi lattiaan jalan viereen. Kierrä toinen käsi ja ylävartalo kohti kattoa. Pidä hetki, palaa ja vaihda puoli. (4-5 kiertoa / puoli)"
        },
        {
          "name": "Lonkan Pyöritykset Seisten",
          "description": "Seiso yhdellä jalalla, ota tukea. Nosta toinen polvi 90 asteen kulmaan. Pyöritä reittä isosti ulko- ja sisäkautta lonkkanivelestä. (8-10 pyöräytystä / suunta / jalka)"
        },
        {
          "name": "Olkapäiden Pyöritykset (CARs)",
          "description": "Seiso ryhdikkäästi. Pidä toinen käsi paikallaan. Lähde viemään toista kättä hitaasti ja hallitusti etukautta ylös, kierrä kämmen ulospäin yläasennossa ja jatka liike hallitusti taakse alas. Palauta alkureittiä. Tee liike mahdollisimman laajasti ilman että vartalo kiertyy liikaa. (3-4 hidasta kiertoa / suunta / käsi)"
        }
      ]
    }
  ],
  "cooldowns": [
    {
      "id": "static_standard",
      "name": "Staattinen Perusjäähdyttely",
      "durationMinutes": 7,
      "description": "Klassisia staattisia venytyksiä tärkeimmille lihasryhmille. Pidä jokaista venytystä rauhallisesti 20-30 sekuntia.",
      "steps": [
        {
          "name": "Takareiden Venytys",
          "description": "Istu lattialla, toinen jalka suorana, toinen koukussa jalkapohja suoran jalan reittä vasten. Taivuta lantiosta suoraa jalkaa kohti pitäen selkä suorana. Tunne venytys takareidessä. Pidä ja vaihda puoli."
        },
        {
          "name": "Pakaran Venytys",
          "description": "Selinmakuulla. Nosta toinen nilkka vastakkaisen polven päälle. Ota käsillä koukussa olevan jalan reiden takaa kiinni ja vedä jalkoja kevyesti kohti rintaa. Tunne venytys pakarassa (nilkka polven päällä oleva puoli). Pidä ja vaihda puoli."
        },
        {
          "name": "Etureiden Venytys",
          "description": "Seisten, ota tukea seinästä. Koukista toinen jalka taakse ja ota nilkasta kiinni. Vedä kantapäätä kohti pakaraa pitäen polvet vierekkäin ja lantio suorassa (älä notkista selkää). Tunne venytys etureidessä. Pidä ja vaihda puoli."
        },
        {
          "name": "Rintalihaksen Venytys",
          "description": "Seiso oviaukossa tai seinän vieressä. Aseta kyynärvarsi seinää vasten n. 90 asteen kulmassa. Astu eteenpäin ja kierrä vartaloa poispäin seinästä, kunnes tunnet venytyksen rinnassa ja etuolkapäässä. Pidä ja vaihda puoli."
        },
        {
          "name": "Hartian/Takaolkapään Venytys",
          "description": "Seisten tai istuen. Ojenna toinen käsi suorana vartalon eteen. Ota toisella kädellä kiinni ojennetun käden olkavarresta ja vedä kättä kevyesti lähemmäs vartaloa. Tunne venytys hartian takaosassa. Pidä ja vaihda puoli."
        },
        {
          "name": "Ojentajan Venytys",
          "description": "Nosta toinen käsi ylös pään viereen. Koukista kyynärpää ja anna kämmenen laskeutua lapaluiden väliin. Ota toisella kädellä kiinni koukistetun käden kyynärpäästä ja paina kevyesti alaspäin/taaksepäin. Tunne venytys ojentajassa. Pidä ja vaihda puoli."
        },
        {
          "name": "Leveä Selkälihas (Lat Stretch)",
          "description": "Polvistu lattialle. Vie kädet pitkälle eteen ja laske rintaa kohti lattiaa, pidä lantio polvien yläpuolella. Tunne venytys selässä ja kainaloiden alla. Voit kokeilla viedä käsiä hieman sivulle tehostaaksesi venytystä."
        }
      ]
    },
    {
      "id": "lower_body_focus_cool",
      "name": "Alavartalopainotteinen Jäähdyttely",
      "durationMinutes": 8,
      "description": "Keskittyy erityisesti jalkojen ja lantion alueen palauttaviin venytyksiin. Pidä venytykset 30 sekuntia.",
      "steps": [
        {
          "name": "Perhosvenytys (Butterfly)",
          "description": "Istu lattialla, tuo jalkapohjat vastakkain ja vedä kantapäitä lähelle vartaloa. Anna polvien laskeutua sivuille. Voit painaa kevyesti polvia alaspäin tai nojata hieman eteenpäin selkä suorana. Tunne venytys sisäreisissä."
        },
        {
          "name": "Syvä Kyykkyasento (Malasana)",
          "description": "Laskeudu syvään kyykkyyn, jalat hieman hartioita leveämmällä, varpaat ulospäin. Pyri pitämään kantapäät lattiassa. Tuo kämmenet yhteen rinnan eteen ja paina kyynärpäillä polvia kevyesti ulospäin. Avaa lantiota."
        },
        {
          "name": "Lonkankoukistajan Venytys",
          "description": "Asetu polviseisontaan, toinen jalka edessä 90 asteen kulmassa. Työnnä lantiota eteenpäin pitäen ylävartalo pystyssä. Tunne venytys takimmaisen jalan lonkan etuosassa. Voit tehostaa nostamalla takimmaisen jalan puoleisen käden ylös. Pidä ja vaihda puoli."
        },
        {
          "name": "Pohkeen Venytys Seinää Vasten",
          "description": "Asetu seinän eteen. Astu toisella jalalla taakse, pidä jalka suorana ja kantapää lattiassa. Nojaa eteenpäin, kunnes tunnet venytyksen takimmaisen jalan pohkeessa. Pidä ja vaihda puoli. Voit tehdä myös polvi hieman koukussa alempaa pohjelihasta varten."
        },
        {
          "name": "Makaava Pakaravenytys (Supine Figure 4)",
          "description": "Selinmakuulla, jalat koukussa, jalkapohjat lattiassa. Nosta oikea nilkka vasemman polven päälle. Pujota oikea käsi jalkojen välistä ja vasen käsi vasemman reiden ulkopuolelta. Ota kiinni vasemman reiden takaa ja vedä jalkoja kevyesti kohti rintaa. Tunne venytys oikeassa pakarassa. Pidä ja vaihda puoli."
        },
        {
          "name": "Takareiden Venytys Selinmakuulla",
          "description": "Selinmakuulla. Nosta toinen jalka suorana kohti kattoa. Ota käsillä kiinni reiden takaa tai pohkeesta (älä polvitaipeesta). Vedä jalkaa kevyesti kohti itseäsi pitäen polvi mahdollisimman suorana. Toinen jalka voi olla koukussa tai suorana lattialla. Pidä ja vaihda puoli."
        }
      ]
    },
    {
      "id": "gentle_mobility_cool",
      "name": "Kevyt Liikkuvuusjäähdyttely",
      "durationMinutes": 6,
      "description": "Rauhallisia liikkuvuusharjoitteita ja kevyitä venytyksiä kehon rentouttamiseen.",
      "steps": [
        {
          "name": "Selinmakuulla Kierrot",
          "description": "Selinmakuulla, levitä kädet sivuille T-asentoon. Koukista polvet ja anna niiden kaatua hallitusti toiselle sivulle. Pidä hartiat lattiassa. Katse voi kääntyä vastakkaiseen suuntaan. Pidä hetki ja vaihda puoli. (3-4 rauhallista vaihtoa / puoli)"
        },
        {
          "name": "Lapsen Asento (Child's Pose)",
          "description": "Polvistu lattialle, isot varpaat yhdessä, polvet lantion leveydellä tai leveämmällä. Laskeudu istumaan kantapäille ja laske ylävartalo reisien väliin tai päälle, otsa lattiaan. Kädet voivat olla ojennettuna eteen tai vartalon vierellä taakse. Hengitä rauhallisesti ja rentoudu."
        },
        {
          "name": "Neulansilmä (Thread the Needle)",
          "description": "Nelinkontin. Pujota oikea käsi vasemman kainalon alta, laske oikea olkapää ja poski lattiaan. Vasen käsi voi jäädä koukkuun eteen tai ojentua eteenpäin. Tunne kierto ja venytys yläselässä ja hartianseudulla. Pidä hetki ja vaihda puoli."
        },
        {
          "name": "Rintarangan Ojennus Polviseisonnassa",
          "description": "Polviseisonnassa noin metrin päässä tuolista tai penkistä. Aseta kyynärpäät tuolin reunalle ja tuo kämmenet yhteen niskan taakse. Laske rintaa alaspäin ja työnnä päätä käsien välistä. Tunne venytys rintarangassa ja ojentajissa."
        },
        {
          "name": "Nilkan Pyörittelyt & Ojennus/Koukistus",
          "description": "Istu lattialla tai tuolilla. Pyörittele toista nilkkaa rauhallisesti molempiin suuntiin. Tee myös nilkan ojennus-koukistusliikettä. Vaihda jalka."
        },
        {
          "name": "Niskan Kevyt Venytys",
          "description": "Istu ryhdikkäästi. Kallista päätä varovasti oikealle, ikään kuin korva menisi kohti olkapäätä. Voit tehostaa kevyesti oikealla kädellä painamalla. ÄLÄ VENYTÄ LIIAN VOIMAKKAASTI. Pidä hetki ja vaihda puoli. Voit tehdä myös kevyen kallistuksen eteenpäin (leuka kohti rintaa)."
        }
      ]
    }
  ],
  "exercises": [
    {
      "id": "goblet_squat",
      "name": "Pokaalikyykky",
      "image": "img/goblet-kyykky.png",
      "description": "1. Ote: Ota kahvakuulasta kiinni sarvista niin, että kuulan pohja osoittaa ylöspäin. Pidä kuula lähellä rintaa.\n2. Asento: Seiso jalat hartianlevyisessä asennossa, varpaat hieman ulospäin.\n3. Liike: Laskeudu hallitusti kyykkyyn työntämällä lantiota taakse ja koukistamalla polvia. Pidä selkä suorana ja rinta ylhäällä.\n4. Syvyys: Mene niin syvälle kuin hyvällä tekniikalla pääset, pyri vähintään reidet vaakatasoon.\n5. Ylösnousu: Ponnista jaloilla takaisin ylös, purista pakarat yläasennossa.\nHuom: Pidä paino kantapäillä/jalan keskiosalla, älä anna polvien kääntyä sisäänpäin.",
      "muscleGroups": ["reidet", "pakarat", "keskivartalo", "ryhti"]
    },
    {
      "id": "two_hand_swing",
      "name": "Kahden käden etuheilautus",
      "image": "img/heilautus.png",
      "description": "1. Asento: Seiso hartioita leveämmässä haara-asennossa, kuula edessäsi lattialla.\n2. Aloitus: Kallista ylävartaloa eteen lantiosta saranoimalla (selkä suorana!) ja tartu kuulaan molemmin käsin.\n3. Taakseveto: Vedä kuula jalkojen välistä taakse kohti nivusia (kuin syöttäisit jenkkifutispalloa).\n4. Heilautus: Ojenna lantio räjähtävästi eteenpäin, anna kuulan heilua eteen rinnan korkeudelle. Kädet ovat 'köydet', voima tulee lantiosta!\n5. Yläasento: Purista pakarat ja vatsalihakset tiukaksi yläasennossa, vartalo suorana linjana.\n6. Alaslasku: Anna kuulan painovoiman viedä se takaisin jalkojen väliin ja aloita heti uusi lantion ojennus.\nHuom: Pidä katse eteenpäin, älä nosta kuulaa käsillä.",
      "muscleGroups": ["pakarat", "takareidet", "alaselkä", "keskivartalo", "voimantuotto"]
    },
    {
      "id": "halo",
      "name": "Halo",
      "image": "img/halo.png",
      "description": "1. Ote: Ota kahvakuulasta kiinni sarvista, pohja ylöspäin. Pidä kuula rinnan edessä.\n2. Asento: Seiso ryhdikkäästi, jalat lantion leveydellä, polvet hieman koukussa.\n3. Liike: Lähde pyörittämään kuulaa pään ympäri toiseen suuntaan. Pidä kuula mahdollisimman lähellä päätä ja vartaloa.\n4. Keskivartalo: Jännitä vatsalihakset ja pakarat, estä lantion ja vartalon heiluminen.\n5. Suunnanvaihto: Kun olet tehnyt halutun määrän toistoja yhteen suuntaan, vaihda pyörityssuuntaa.\nHuom: Liike on hidas ja hallittu, keskity hartiarenkaan liikkuvuuteen.",
      "muscleGroups": ["hartiat", "keskivartalo", "liikkuvuus", "yläselkä"]
    },
    {
      "id": "bent_over_row",
      "name": "Kulmasoutu",
      "image": "img/soutu.png",
      "description": "1. Asento: Aseta kuula lattialle. Ota tukeva haara-asento. Nojaa eteenpäin lantiosta niin, että selkä on lähes vaakatasossa ja suorana. Voit tukea vapaan käden polveen tai penkkiin.\n2. Ote: Tartu kuulasta neutraalilla otteella (kämmen vartaloa kohti).\n3. Veto: Vedä kuulaa kohti kylkeä/lantiota vetämällä kyynärpäätä taakse ja puristamalla lapaluuta selkärankaa kohti.\n4. Huippusupistus: Pidä yläasento hetki ja tunne supistus selässä.\n5. Laske: Laske kuula hallitusti takaisin alas lähtöasentoon.\nHuom: Pidä selkä suorana koko liikkeen ajan, älä päästä sitä pyöristymään. Tee molemmat puolet.",
      "muscleGroups": ["yläselkä", "lavanlähentäjät", "hauikset", "epäkäs"]
    },
    {
        "id": "one_hand_swing",
        "name": "Yhden käden etuheilautus",
        "image": "img/one-hand-swing.png",
        "description": "Periaate sama kuin kahden käden heilautuksessa, mutta kuula yhdessä kädessä.\n1. Aloitus: Tartu kuulaan yhdellä kädellä.\n2. Heilautus: Tee lantion sarana ja räjähtävä ojennus kuten kahden käden versiossa.\n3. Vartalon Hallinta: Keskity pitämään vartalo suorassa linjassa – ÄLÄ anna sen kiertyä kuulan mukana. Hartioiden ja lantion tulisi osoittaa eteenpäin koko liikkeen ajan.\n4. Vapaa Käsi: Voit pitää vapaan käden sivulla, edessä 'kilpenä' tai antaa sen seurata kevyesti liikettä mukana.\n5. Otteen Vaihto (valinnainen): Voit vaihtaa kättä heilautuksen yläasennossa turvallisesti, jos teet pidempää sarjaa.\nHuom: Tämä vaatii enemmän keskivartalon hallintaa kuin kahden käden heilautus.",
        "muscleGroups": ["pakarat", "takareidet", "keskivartalo", "selkä", "hartiat", "puristusvoima"]
    },
    {
        "id": "clean",
        "name": "Rinnalleveto",
        "image": "img/clean.png",
        "description": "Nostaa kuulan maasta tai heilautuksesta hallitusti rinnalle 'räkkiasentoon'.\n1. Aloitus: Kuten heilautuksessa (maasta tai taaksevedosta).\n2. Nosto: Käytä lantion ojennusta nostamaan kuula ylöspäin. Pidä kuula lähellä vartaloa.\n3. Käden Vienti Läpi: Kun kuula on nousemassa, vedä kyynärpää taakse ja anna käden 'sukeltaa' kuulan kahvan ali.\n4. Räkkiasento: Vastaanota kuula pehmeästi rintakehän päälle / olkapään eteen. Kyynärpää on lähellä kylkeä, ranne suorana.\n5. Vaimennus: Jalkojen tulisi hieman joustaa vastaanotossa.\nHuom: Vältä kuulan 'kolahdusta' ranteeseen tai olkapäähän. Harjoittele liikettä hitaasti.",
        "muscleGroups": ["pakarat", "reidet", "keskivartalo", "selkä", "hartiat", "käsivarret"]
    },
    {
        "id": "overhead_press",
        "name": "Pystypunnerrus",
        "image": "img/pystypunnerrus.png",
        "description": "1. Aloitus: Seiso ryhdikkäästi, kuula räkkiasennossa (Cleanin jälkeen).\n2. Keskivartalon Tuki: Jännitä vatsa ja pakarat tiukaksi.\n3. Punnerrus: Punnerra kuula suoraan ylöspäin pään viereen, kunnes käsi on täysin suorana.\n4. Linjaus: Yläasennossa käsivarsi on lähellä korvaa, hauis korvan kohdalla.\n5. Laske: Laske kuula hallitusti takaisin räkkiasentoon.\nHuom: Pidä ranne suorana koko liikkeen ajan. Älä nojaa taaksepäin.",
        "muscleGroups": ["hartiat", "ojentajat", "yläselkä", "keskivartalo"]
    },
    {
        "id": "reverse_lunge",
        "name": "Askelkyykky taakse",
        "image": "img/askelkyykky.png",
        "description": "1. Aloitus: Seiso suorana, kuula joko rinnalla pokaaliotteessa tai yhdellä kädellä vartalon sivulla (tai räkissä).\n2. Askel Taakse: Astu toisella jalalla pitkä askel suoraan taakse.\n3. Lasku: Laskeudu alas koukistamalla molempia polvia, kunnes etummainen reisi on noin vaakatasossa ja takimmainen polvi lähellä lattiaa. Molemmat polvet n. 90 asteen kulmassa.\n4. Ylävartalo: Pidä ylävartalo pystyssä ja keskivartalo tiukkana.\n5. Ponnistus: Ponnista etummaisen jalan kantapäällä takaisin alkuasentoon.\n6. Vaihto: Tee haluttu määrä toistoja yhdellä jalalla tai vuorotellen.\nHuom: Pidä etummainen polvi linjassa varpaiden kanssa, älä anna sen kääntyä sisään.",
        "muscleGroups": ["reidet", "pakarat", "keskivartalo", "tasapaino"]
    },
    {
        "id": "farmers_carry",
        "name": "Farmarikävely",
        "image": "img/farmers-walk.png",
        "description": "1. Ote: Ota yksi tai kaksi kahvakuulaa käteen/käsiin. Pidä ote tiukkana.\n2. Ryhti: Seiso suorana, vedä hartiat taakse ja alas, pidä rinta auki.\n3. Keskivartalo: Jännitä keskivartalo tukevaksi.\n4. Kävely: Kävele määrätty matka tai aika ryhdikkäästi, kontrolloiduilla askelilla. Älä anna vartalon heilua sivusuunnassa.\n5. Yhdellä Kuulalla: Jos käytät vain yhtä kuulaa, vastusta vartalon kallistumista vastakkaiselle puolelle. Vaihda kuulan puolta puolivälissä tai kierrosten välissä.\nHuom: Tämä harjoittaa pitoa, keskivartaloa ja ryhtiä.",
        "muscleGroups": ["koko keho", "puristusvoima", "kyynärvarret", "epäkäs", "keskivartalo", "ryhti"]
    },
    {
        "id": "snatch",
        "name": "Tempaus",
        "image": "img/snatch.png",
        "description": "Räjähtävä liike, jossa kuula heilautetaan yhdellä liikkeellä suoraan pään päälle.\n1. Aloitus: Kuten yhden käden heilautuksessa.\n2. Heilautus & Veto: Käytä voimakasta lantion ojennusta. Kun kuula nousee, vedä kyynärpäätä korkealle ja taakse (kuin käynnistäisit ruohonleikkuria).\n3. Käden Pujotus: Kun kuula saavuttaa rinnan korkeuden, anna käden 'pujottautua' kahvan läpi.\n4. Lukitus Ylhäällä: Ojenna käsi täysin suoraksi pään päälle. Vastaanota kuula pehmeästi kämmenselkään, älä anna sen paiskautua.\n5. Laske: Laske kuula hallitusti joko suoraan alas tai heilautuksen kautta takaisin jalkojen väliin.\nHuom: Vaatii hyvää tekniikkaa ja ajoitusta. Aloita kevyellä kuulalla.",
        "muscleGroups": ["koko keho", "pakarat", "reidet", "selkä", "hartiat", "keskivartalo", "voimantuotto"]
    },
    {
        "id": "clean_and_press",
        "name": "Rinnalleveto ja Työntö",
        "image": "img/clean-press.png",
        "description": "Yhdistää kaksi liikettä: Rinnalleveto (Clean) ja Pystypunnerrus (Press).\n1. Clean: Tee rinnalleveto nostaen kuula räkkiasentoon.\n2. Vakauta: Varmista hyvä, tukeva asento räkissä.\n3. Press: Punnerra kuula suoralle kädelle pään päälle.\n4. Laske: Laske kuula hallitusti takaisin räkkiasentoon ja sieltä alas (esim. heilautuksen kautta tai suoraan maahan).\nHuom: Tee liikkeet peräkkäin, mutta selkeinä erillisinä vaiheina, älä hosu.",
        "muscleGroups": ["koko keho", "reidet", "pakarat", "hartiat", "keskivartalo", "ojentajat"]
    },
    {
        "id": "front_squat",
        "name": "Etukyykky",
        "image": "img/etukyykky.png",
        "description": "Kyykky kuula(t) räkkiasennossa.\n1. Aloitus: Vedä yksi tai kaksi kuulaa rinnalle räkkiasentoon (Clean).\n2. Asento: Seiso ryhdikkäästi, jalat hartianleveydellä, keskivartalo tiukkana.\n3. Kyykky: Laskeudu kyykkyyn pitäen selkä mahdollisimman pystyssä ja kyynärpäät ylhäällä (eivät saa tippua reisien päälle).\n4. Syvyys: Mene niin syvälle kuin pystyt hyvällä ryhdillä.\n5. Ylösnousu: Ponnista takaisin ylös.\nHuom: Etukyykky haastaa enemmän etureisiä ja keskivartalon pitoa kuin takakyykky tai pokaalikyykky.",
        "muscleGroups": ["reidet", "pakarat", "keskivartalo", "ryhti", "hartiat"]
    },
    {
        "id": "turkish_get_up",
        "name": "Turkkilainen Ylösnousu (TGU)",
        "image": "img/turkish-getup.png",
        "description": "Monivaiheinen liike lattialta ylös ja takaisin, kuula koko ajan ylhäällä. Vaatii keskittymistä!\n1. Aloitus (oikea käsi): Makaa selälläsi, oikea käsi ojentuneena kohti kattoa kuulan kanssa. Oikea polvi koukussa, jalkapohja lattiassa. Vasen käsi ja jalka suorana sivulla.\n2. Kyynärnojaan: Nouse vasemman kyynärpään varaan pitäen katse kuulassa.\n3. Suoralle Kädele: Ojenna vasen käsi suoraksi.\n4. Lantion Nosto: Nosta lantio korkealle ilmaan.\n5. Jalan Vienti Alle: Vie vasen jalka vartalon ali polviseisontaan oikean jalan taakse.\n6. Ylösnousu: Nouse hallitusti seisomaan.\n7. Alasmeno: Peruuta vaiheet päinvastaisessa järjestyksessä hallitusti takaisin makuulle.\nHuom: Tee liike hitaasti ja kontrolloidusti. Harjoittele ensin ilman painoa. Katse seuraa kuulaa suurimman osan liikkeestä.",
        "muscleGroups": ["koko keho", "keskivartalo", "hartiat", "lonkat", "tasapaino", "liikkuvuus"]
    },
    {
        "id": "windmill",
        "name": "Tuulimylly",
        "image": "img/windmill.png",
        "description": "Liikkuvuus- ja voimaliike keskivartalolle ja hartioille.\n1. Aloitus: Seiso jalat leveällä (leveämpi kuin hartiat), varpaat noin 45 asteen kulmassa ulospäin. Nosta kuula suoralle kädelle pään päälle (esim. oikea käsi).\n2. Katse: Pidä katse kuulassa koko liikkeen ajan.\n3. Lantion Siirto: Työnnä lantiota sivulle ja taakse (kuulaa vastakkaiseen suuntaan, eli vasemmalle).\n4. Lasku: Kallista ylävartaloa ja liu'uta vapaata (vasenta) kättä reittä/säärtä pitkin alas kohti lattiaa. Pidä kuulaa kantava käsi ja molemmat jalat mahdollisimman suorina.\n5. Ylösnousu: Nouse hallitusti takaisin alkuasentoon käyttäen vinoja vatsalihaksia ja pakaroita.\nHuom: Liike tapahtuu lantiosta, ei selkärangasta. Vaatii hyvää liikkuvuutta.",
        "muscleGroups": ["keskivartalo", "vinot vatsalihakset", "takareidet", "pakarat", "hartiat", "liikkuvuus"]
    },
    {
        "id": "rack_carry",
        "name": "Räkkikanto",
        "image": "img/rack-carry.png",
        "description": "Kävely kuula(t) räkkiasennossa.\n1. Aloitus: Vedä yksi tai kaksi kuulaa rinnalle räkkiasentoon (Clean).\n2. Asento: Seiso ryhdikkäästi, pidä kyynärpää(t) lähellä kylkeä, ranne suorana, kuula lepää olkapään/rintakehän päällä.\n3. Keskivartalo: Jännitä keskivartalo tiukaksi.\n4. Kävely: Kävele määrätty matka tai aika pitäen asento vakaana ja ryhti hyvänä.\n5. Yhdellä Kuulalla: Vastusta vartalon kiertymistä ja kallistumista.\nHuom: Haastaa keskivartalon pitoa ja hartian/ranteen asentoa.",
        "muscleGroups": ["keskivartalo", "hartiat", "selkä", "reidet", "pakarat", "ryhti"]
    },
    {
        "id": "waiters_carry",
        "name": "Tarjoilijankanto",
        "image": "img/waiters-carry.png",
        "description": "Kävely kuula suoralla kädellä pään päällä.\n1. Aloitus: Nosta kuula turvallisesti suoralle kädelle pään päälle (esim. Clean + Press tai Snatch).\n2. Asento: Lukitse olkapää (vedä lapa alas), pidä käsivarsi pystysuorassa, ranne neutraalina.\n3. Keskivartalo: Jännitä keskivartalo erittäin tiukaksi.\n4. Kävely: Kävele määrätty matka tai aika hitaasti ja hallitusti. Pidä katse eteenpäin.\n5. Laske: Laske kuula turvallisesti alas (esim. hallitusti räkkiin ja maahan).\nHuom: Erittäin haastava tasapainolle ja hartian vakaudelle. Aloita kevyellä painolla.",
        "muscleGroups": ["hartiat", "keskivartalo", "tasapaino", "ryhti", "ojentajat"]
    }
  ],
  "kettlebellProgram11Weeks": {
    "programInfo": {
        "programName": "11 Viikon Kahvakuulaohjelma (4 Tasoa)",
        "frequency": "1 kerta / viikko",
        "estimatedTotalDurationMinutes": 45,
        "workoutDurationMinutes": 30,
        "levels": [
            { "level": 1, "description": "Vasta-alkaja: Perusteiden turvallinen oppiminen, kevyet painot, pidemmät tauot." },
            { "level": 2, "description": "Harrastelija: Perusliikkeet hallussa, intensiteetin ja volyymin nosto, keskipainot." },
            { "level": 3, "description": "Kokenut: Hyvä tekniikka, voiman ja kestävyyden haastaminen, raskaammat painot, lyhyemmät tauot." },
            { "level": 4, "description": "Expertti: Erinomainen tekniikka ja voimataso, maksimaalinen teho ja kestävyys, haastavat painot/yhdistelmät." }
        ]
    },
    "phases": [
      {
        "phaseInfo": {
            "name": "Perusteiden Vahvistaminen",
            "weeks": [1, 2, 3],
            "focus": "Liikeratojen opettelu, keskivartalon tuki, perusliikkeiden hallinta."
        },
        "workoutPlan": {
          "rounds": "3-4 (aloita 3:sta, lisää 4. viikolla 3 jos sopii)",
          "restBetweenRoundsSeconds": "60-90"
        },
        "levels": {
          "1": { "timeBased": { "workSeconds": 30, "restSeconds": 30 }, "repBased": { "repsDescription": "8 toistoa (Halo 4/suunta)", "restBetweenExercisesSeconds": "15-20" } },
          "2": { "timeBased": { "workSeconds": 35, "restSeconds": 25 }, "repBased": { "repsDescription": "10 toistoa (Halo 5/suunta)", "restBetweenExercisesSeconds": "15-20" } },
          "3": { "timeBased": { "workSeconds": 40, "restSeconds": 20 }, "repBased": { "repsDescription": "12 toistoa (Halo 6/suunta)", "restBetweenExercisesSeconds": "15-20" } },
          "4": { "timeBased": { "workSeconds": 45, "restSeconds": 15 }, "repBased": { "repsDescription": "15 toistoa (Halo 8/suunta)", "restBetweenExercisesSeconds": "15-20" } }
        },
        "weeklyExercises": [
          { "exerciseId": "two_hand_swing", "displayTitle": "Kahden käden etuheilautus" },
          { "exerciseId": "goblet_squat", "displayTitle": "Pokaalikyykky" },
          { "exerciseId": "halo", "displayTitle": "Halo", "notes": "Vaihda kiertosuuntaa joka kierroksella tai puolivälissä." },
          { "exerciseId": "bent_over_row", "displayTitle": "Kulmasoutu (Vasen)" },
          { "exerciseId": "bent_over_row", "displayTitle": "Kulmasoutu (Oikea)" }
        ]
      },
      {
        "phaseInfo": {
            "name": "Kehitys & Yhden Käden Liikkeet",
            "weeks": [4, 5, 6, 7],
            "focus": "Työkapasiteetin nosto, yhden käden liikkeiden ja koordinaation kehittäminen."
        },
        "workoutPlan": { "rounds": "4", "restBetweenRoundsSeconds": "60" },
        "levels": {
          "1": { "timeBased": { "workSeconds": 35, "restSeconds": 25 }, "repBased": { "repsDescription": "6-8 per puoli (Farmarikävely ~20m)", "restBetweenExercisesSeconds": "10-15" } },
          "2": { "timeBased": { "workSeconds": 40, "restSeconds": 20 }, "repBased": { "repsDescription": "8-10 per puoli (Farmarikävely ~30m)", "restBetweenExercisesSeconds": "10-15" } },
          "3": { "timeBased": { "workSeconds": 45, "restSeconds": 15 }, "repBased": { "repsDescription": "10-12 per puoli (Farmarikävely ~40m)", "restBetweenExercisesSeconds": "10-15" } },
          "4": { "timeBased": { "workSeconds": 50, "restSeconds": 10 }, "repBased": { "repsDescription": "12-15 per puoli (Farmarikävely ~50m)", "restBetweenExercisesSeconds": "10-15" } }
        },
        "weeklyExercises": [
          { "exerciseId": "one_hand_swing", "displayTitle": "1K Etuheilautus (Vasen)", "notes": "Taso 1 voi tehdä 2K." },
          { "exerciseId": "one_hand_swing", "displayTitle": "1K Etuheilautus (Oikea)", "notes": "Taso 1 voi tehdä 2K." },
          { "exerciseId": "clean", "displayTitle": "Rinnalleveto (Vasen)", "notes": "Taso 1 voi tehdä pokaalikyykyn." },
          { "exerciseId": "clean", "displayTitle": "Rinnalleveto (Oikea)", "notes": "Taso 1 voi tehdä pokaalikyykyn." },
          { "exerciseId": "overhead_press", "displayTitle": "Pystypunnerrus (Vasen)" },
          { "exerciseId": "overhead_press", "displayTitle": "Pystypunnerrus (Oikea)" },
          { "exerciseId": "reverse_lunge", "displayTitle": "Askelkyykky taakse (Vasen jalka taakse)", "notes": "Kuula V tai pokaali." },
          { "exerciseId": "reverse_lunge", "displayTitle": "Askelkyykky taakse (Oikea jalka taakse)", "notes": "Kuula O tai pokaali." },
          { "exerciseId": "farmers_carry", "displayTitle": "Farmarikävely", "notes": "1 kuula: vaihda puolta / kierros. 2 kuulaa: tee molemmilla." }
        ]
      },
      {
        "phaseInfo": {
            "name": "Huippu & Haastavammat Liikkeet",
            "weeks": [8, 9, 10, 11],
            "focus": "Voimakestävyys, teho, haastavammat liikkeet ja liikeyhdistelmät. Valitse 4-5 liikeparia/liikettä viikoittain."
        },
        "workoutPlan": { "rounds": "4-5 (Pyri 5:een vko 10-11)", "restBetweenRoundsSeconds": "45-60" },
        "levels": {
          "1": { "timeBased": { "workSeconds": 40, "restSeconds": 20 }, "repBased": { "repsDescription": "5-6 per puoli (TGU 1/puoli, Kanto ~20m)", "restBetweenExercisesSeconds": "10" } },
          "2": { "timeBased": { "workSeconds": 45, "restSeconds": 15 }, "repBased": { "repsDescription": "6-8 per puoli (TGU 1/puoli, Kanto ~30m)", "restBetweenExercisesSeconds": "10" } },
          "3": { "timeBased": { "workSeconds": 50, "restSeconds": 10 }, "repBased": { "repsDescription": "8-10 per puoli (TGU 1-2/puoli, Kanto ~40m)", "restBetweenExercisesSeconds": "10" } },
          "4": { "timeBased": { "workSeconds": 50, "restSeconds": 10, "notes": "Tai AMRAP-osioita" }, "repBased": { "repsDescription": "10+ per puoli (TGU 1-2/puoli, Kanto ~50m+)", "restBetweenExercisesSeconds": "0-10" } }
        },
        "exerciseOptions": [
           { "optionId": "snatch_pair", "exercises": [ { "exerciseId": "snatch", "displayTitle": "Tempaus (Vasen)", "notes": "T1-2: 1h heil./clean." }, { "exerciseId": "snatch", "displayTitle": "Tempaus (Oikea)", "notes": "T1-2: 1h heil./clean." } ] },
           { "optionId": "cleanpress_pair", "exercises": [ { "exerciseId": "clean_and_press", "displayTitle": "Rinnalleveto ja Työntö (V)" }, { "exerciseId": "clean_and_press", "displayTitle": "Rinnalleveto ja Työntö (O)" } ] },
           { "optionId": "frontsquat_pair", "exercises": [ { "exerciseId": "front_squat", "displayTitle": "Etukyykky (1 kuula V)", "notes": "Tai 2 kuulaa." }, { "exerciseId": "front_squat", "displayTitle": "Etukyykky (1 kuula O)", "notes": "Tai 2 kuulaa." } ] },
           { "optionId": "tgu_pair", "exercises": [ { "exerciseId": "turkish_get_up", "displayTitle": "TGU (Vasen)", "notes": "T1-2: Puolikas. Aikaa!" }, { "exerciseId": "turkish_get_up", "displayTitle": "TGU (Oikea)", "notes": "T1-2: Puolikas." } ] },
           { "optionId": "windmill_pair", "exercises": [ { "exerciseId": "windmill", "displayTitle": "Tuulimylly (V kuula ylh.)" }, { "exerciseId": "windmill", "displayTitle": "Tuulimylly (O kuula ylh.)" } ] },
           { "optionId": "rackcarry_pair", "exercises": [ { "exerciseId": "rack_carry", "displayTitle": "Räkkikanto (V kuula)", "notes": "Tai 2 kuulaa." }, { "exerciseId": "rack_carry", "displayTitle": "Räkkikanto (O kuula)", "notes": "Tai 2 kuulaa." } ] },
           { "optionId": "waiterscarry_pair", "exercises": [ { "exerciseId": "waiters_carry", "displayTitle": "Tarjoilijankanto (V käsi)" }, { "exerciseId": "waiters_carry", "displayTitle": "Tarjoilijankanto (O käsi)" } ] }
        ],
         "exampleWeeklyExercises": [
              { "exerciseId": "snatch", "displayTitle": "Tempaus (Vasen)", "notes": "T1-2: 1h heil./clean." }, { "exerciseId": "snatch", "displayTitle": "Tempaus (Oikea)", "notes": "T1-2: 1h heil./clean." },
              { "exerciseId": "front_squat", "displayTitle": "Etukyykky (1 kuula V)", "notes": "Tai 2 kuulaa." }, { "exerciseId": "front_squat", "displayTitle": "Etukyykky (1 kuula O)", "notes": "Tai 2 kuulaa." },
              { "exerciseId": "turkish_get_up", "displayTitle": "TGU (Vasen)", "notes": "T1-2: Puolikas. Aikaa!" }, { "exerciseId": "turkish_get_up", "displayTitle": "TGU (Oikea)", "notes": "T1-2: Puolikas." },
              { "exerciseId": "rack_carry", "displayTitle": "Räkkikanto (V kuula)", "notes": "Tai 2 kuulaa." }, { "exerciseId": "rack_carry", "displayTitle": "Räkkikanto (O kuula)", "notes": "Tai 2 kuulaa." }
        ]
      }
    ]
  }
}
